/* automatically generated by rust-bindgen 0.71.1 */

pub const CAPABILITY_FUNCTION_NAME_LEN: u32 = 256;
pub const CAPABILITY_NUMBER_OF_CAPABILITIES: u32 = 20;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct capability {
    pub name: [::std::os::raw::c_char; 256usize],
    pub function: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of capability"][::std::mem::size_of::<capability>() - 264usize];
    ["Alignment of capability"][::std::mem::align_of::<capability>() - 8usize];
    ["Offset of field: capability::name"][::std::mem::offset_of!(capability, name) - 0usize];
    ["Offset of field: capability::function"]
        [::std::mem::offset_of!(capability, function) - 256usize];
};
pub type Capability = capability;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct capabilities_ {
    pub capability: [Capability; 20usize],
    pub n_capabilities: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of capabilities_"][::std::mem::size_of::<capabilities_>() - 5288usize];
    ["Alignment of capabilities_"][::std::mem::align_of::<capabilities_>() - 8usize];
    ["Offset of field: capabilities_::capability"]
        [::std::mem::offset_of!(capabilities_, capability) - 0usize];
    ["Offset of field: capabilities_::n_capabilities"]
        [::std::mem::offset_of!(capabilities_, n_capabilities) - 5280usize];
};
pub type Capabilities = capabilities_;
